fw-team-ets/cstd-smart-office/firmware/sdkconfig.defaults
# ── Target / flash ────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ── PSRAM: MUST stay off ──────────────────────────────────────────────────────
# GPIO36 doubles as octal-PSRAM SPI D4 and is loaded by the 5 V regulator EN
# circuit on the mainboard. Turning PSRAM on drives that net and the stage-2
# bootloader dies with RTCWDT_RTC_RST before any application code runs. This is
# not a performance trade-off, it is a hardware constraint.
CONFIG_SPIRAM=n

# ── Partition table ───────────────────────────────────────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xC000

# ── Security features explicitly NOT used ─────────────────────────────────────
# Secure Boot V2, flash encryption and eFuse burning are all out of scope for
# this rewrite (spec v0.1 section 2 / Q9). Stated here so that a future
# `menuconfig` session does not silently enable one of them.
CONFIG_SECURE_BOOT=n
CONFIG_SECURE_FLASH_ENC_ENABLED=n

# ── TLS ───────────────────────────────────────────────────────────────────────
CONFIG_MBEDTLS_SSL_PROTO_TLS1_3=y
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_ESP_TLS_SERVER=y
# Each handshake costs roughly 40 KB of heap; the fragment length cap keeps the
# per-connection record buffers from taking 32 KB of that on their own.
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=8192

# ── HTTP server ───────────────────────────────────────────────────────────────
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=256

# ── Ethernet: W5500 over SPI only, no internal EMAC ───────────────────────────
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y
CONFIG_ETH_USE_ESP32_EMAC=n

# ── lwIP ──────────────────────────────────────────────────────────────────────
# Raw sockets are what the iPad reachability watchdog pings with.
CONFIG_LWIP_IPV6=n
CONFIG_LWIP_SO_RCVBUF=y

# ── Watchdogs ─────────────────────────────────────────────────────────────────
# The task watchdog is subscribed to by the supervisor task ONLY (single-owner
# rule, spec section 7.8): every other task reports liveness through
# supervisor_beat() instead, so a task that dies silently still causes a reset
# instead of another task feeding the watchdog on its behalf.
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_INT_WDT=y

# ── Logging ───────────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ── Console ───────────────────────────────────────────────────────────────────
# UART0 on GPIO43/44 (ESP_TX0/ESP_RX0), which is how PCBA Rev 1.1 is wired for
# flashing and for reading the log. Nothing else in this firmware claims those
# pins: the MicroPython build put its manual-open button on GPIO44, and that is
# exactly the clash this build avoids by having no button at all.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# ── Main task ─────────────────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_FREERTOS_HZ=1000
